tutorials/compressible/sonicFoam/laminar/shockTube/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

restore0Dir
runApplication blockMesh
runApplication setFields
runApplication $(getApplication)
runApplication -s sample postProcess -func sample -noZero

#------------------------------------------------------------------------------
